// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// Перша частина першого завдання
for (let i = 0; i < 10; i++) {
    document.write(`<div>Блок ${i + 1} з довільним текстом</div>`);
}
// Друга частина першого завдання
for (let i = 0; i < 10; i++) {
    document.write(`<div>Блок ${i + 1} з індексом ${i}</div>`);
}
// Третя частина першого завдання
let count = 0;
while (count < 20) {
    document.write(`<h1>Заголовок</h1>`);
    count++;
}
// Четверта частина першого завдання
let index = 0;
while (index < 20) {
    document.write(`<h1>Заголовок з індексом ${index}</h1>`);
    index++;
}
